api/models/form/CompanyForm.php

    private function create()
    {
        $transaction = Yii::$app->db->beginTransaction();
        $user = new User([
            'email' => $this->login,
            'status' => User::STATUS_ACTIVE,
            'phone' => $this->phone,
            'role' => User::ROLE_COMPANY
        ]);

        $user->setPassword($this->password);
        $user->generateAuthKey();
        $user->setToken();

        if (!$user->save()) {
---
INSERT INTO "user" ("email", "status", "phone", "role", "password_hash", "auth_key", "token", "created_at", "updated_at") VALUES ('bahodir@gmail.com', 10, '+99899398555', 2, '$2y$13$/r.LWshI/5JNc21Mr8UQcOIUSaIIj/SeCb.cR/ADPUhR1twvTD9.6', 'zIf6S58nP8LsjCtLrrmN9Bd9uoiiOBtJ', 'UPG3uULKXrYzk7L4noFeXzhNB7VlmKxUlVp4jdOW4y5uOKgjfi_Cn2Oxgi6E6DNu', 1665722405, 1665722405) RETURNING "id"


        ]);

        if (!$company->save()) {
---
INSERT INTO "company" ("email", "phone", "website", "boss_full_name", "status", "address", "company_name", "user_id", "created_at", "updated_at", "created_by", "updated_by") VALUES ('nimadur@gmail.com', '+99899398555', 'nimadur.uz', 'Bahodir', 1, NULL, 'Bahodir xolding', 2, 1665722405, 1665722405, 1, 1) RETURNING "id"