common/models/User.php

    public static function findIdentityByAccessToken($token, $type = null)
    {
        return static::findOne(['token' => $token, 'status' => self::STATUS_ACTIVE]);
---
SELECT * FROM "user" WHERE ("token"='27IIdbdSvQ5Os3HVG_pOJi48K1Hw-1pATcFozXqyvqHa12zyMyCo9ctmIh25DnGz') AND ("status"=10)

    public static function findByEmail($email)
    {
        return static::findOne(['email' => $email, 'status' => self::STATUS_ACTIVE]);
---
SELECT * FROM "user" WHERE ("email"='test@gmail.com') AND ("status"=10)

    public function updateToken()
    {
        return $this->updateAttributes([
            'token' => self::generateToken()
        ]);
---
UPDATE "user" SET "token"='27IIdbdSvQ5Os3HVG_pOJi48K1Hw-1pATcFozXqyvqHa12zyMyCo9ctmIh25DnGz' WHERE "id"=1